[
  {
    "id": 1,
    "headline": "India–China Relations Gain Momentum Amid Trump’s Trade Pressure",
    "details": "China lifted export restrictions on fertilizers, rare earth minerals, magnets, and tunnel boring machines to India, marking fresh momentum in trade ties between the two neighbors. The breakthrough followed talks between External Affairs Minister S. Jaishankar and Chinese Foreign Minister Wang Yi. During his two-day visit to India, Wang assured Jaishankar that Beijing had already acted on New Delhi’s requests, with shipments of the restricted items understood to be underway. This development signaled a pragmatic recalibration in bilateral relations. Both countries recognized that cooperation in critical sectors could ease supply chain pressures and foster stability in an uncertain global order. Rather than a reset driven by sentiment, the move represented a calculated opening—collaborating where interests aligned, managing differences carefully, and building predictability into a fraught relationship. The thaw came after relations between Washington and New Delhi soured when U.S. President Donald Trump doubled tariffs on Indian goods to 50%, including an extra 25% penalty tied to India’s purchases of Russian oil.",
    "reporter": "BBC News",
    "date": "2025-08-01 09:30",
    "image": "1.webp",
    "votes": {
      "real": 94,
      "fake": 15
    },
    "comments": []
  },
  {
    "id": 2,
    "headline": "Trump’s Tariffs Hit India: Impact on GDP, Debt, and Equity Markets",
    "details": "The decision by U.S. President Donald Trump to double tariffs on Indian exports from 25% to 50% introduced a complex challenge for India’s economy. The new tariffs, effective 27 August, delivered an immediate shock to exporters but left a 21-day window for India to negotiate. Businesses and industry groups anticipated targeted government support to mitigate the impact. India’s exports to the U.S. were concentrated in labor- and skill-intensive sectors such as textiles, gems and jewelry, pharmaceuticals, electronics, steel, IT services, and refined petroleum products. In FY24, exports in textiles totaled over $11 billion, gems and jewelry $10 billion, and electronics $8 billion, according to the Ministry of Commerce and Industry. These three sectors alone accounted for more than $29 billion and were the most exposed. The steel sector faced pricing disadvantages in the sensitive global market, while IT services risked reduced demand and greater regulatory scrutiny. Refiners and oil exporters also faced pressure, as potential extension of tariffs to refined petroleum products could disrupt long-term planning and profitability, especially given India’s strategic energy ties with Russia and China.",
    "reporter": "CNN News",
    "date": "2025-08-01 14:00",
    "image": "2.webp",
    "votes": {
      "real": 4,
      "fake": 0
    },
    "comments": []
  },
  {
    "id": 3,
    "headline": "Canon Expands Industrial Solutions in Nagpur",
    "details": "As Nagpur emerged as a hub for defense manufacturing, pharmaceutical production, and India’s lithium battery ventures, Canon positioned itself to move beyond its traditional printing solutions. At the ET Make in India SME Regional Summit in Nagpur, Canon outlined an expansion strategy that included MRI machines, CT scanners, and semiconductor manufacturing equipment for Indian MSMEs. The company’s diversification reflected the evolving needs of India’s industrial landscape. Canon had recently entered the medical equipment sector with MRI machines, CT scanners, and digital X-ray systems available nationwide. It also began developing semiconductor manufacturing equipment, aligning with India’s push for domestic semiconductor production. For Nagpur, Canon’s expansion matched the city’s transformation into a multi-sectoral industrial hub. Defense manufacturing demanded precision imaging, pharmaceutical production required medical equipment, and the lithium battery sector needed advanced manufacturing solutions—all areas where Canon was now active.",
    "reporter": "Reuters",
    "date": "2025-08-02 10:20",
    "image": "3.webp",
    "votes": {
      "real": 54,
      "fake": 4
    },
    "comments": []
  },
  {
    "id": 4,
    "headline": "Chevrolet Unveils Electric and Hybrid Corvette Concepts",
    "details": "General Motors revealed two Chevrolet Corvette concept vehicles, the all-electric Corvette CX and the hybrid CX.R Vision Gran Turismo, at The Quail automotive event in Carmel, California. These models represented GM’s vision for future high-performance vehicles and concluded its 2024 Corvette concept series. The design, developed at Chevrolet’s Performance Studio in Michigan, drew inspiration from fighter jets and video games. The Corvette CX introduced a canopy opening system that swung forward like a tipping hat, replacing traditional doors. The all-wheel-drive supercar featured four motors, one at each wheel, generating over 2,000 horsepower. A 90-kWh lithium-ion battery was integrated into the chassis for optimal weight distribution and a low center of gravity.",
    "reporter": "Al Jazeera",
    "date": "2025-08-03 11:45",
    "image": "4.webp",
    "votes": {
      "real": 33,
      "fake": 0
    },
    "comments": []
  },
  {
    "id": 5,
    "headline": "UK Withdraws Demand in Apple Privacy Dispute",
    "details": "The UK withdrew its controversial demand for Apple to provide access to encrypted data of global users. The request, made under the Investigatory Powers Act, had sparked outrage from privacy advocates who argued that creating a backdoor would threaten personal and national security. Apple had previously responded by removing its Advanced Data Protection (ADP) from the UK market and initiating legal proceedings to challenge the order. While Apple maintained that it never created backdoors to its products, the UK government emphasized its cooperation with the U.S. in combating terrorism and child abuse facilitated by technology. Civil rights groups welcomed the withdrawal, but concerns persisted that similar powers could be used by future governments. Privacy organizations stressed that the UK’s legal authority to demand access to encrypted services still posed risks to civil liberties and digital security.",
    "reporter": "NDTV",
    "date": "2025-08-04 09:00",
    "image": "5.webp",
    "votes": {
      "real": 30,
      "fake": 8
    },
    "comments": []
  },
  {
    "id": 6,
    "headline": "Apple to Invest $100 Billion in the U.S.",
    "details": "Apple announced an additional $100 billion investment in the U.S. following pressure from President Donald Trump. The White House confirmed that the funds would be directed toward domestic supply chain expansion, including new data centers and a smart glass production line in Kentucky. Trump praised the move as a victory for American manufacturing and emphasized that Apple would avoid tariffs on semiconductors by shifting production to the U.S. CEO Tim Cook highlighted the company’s earlier $500 billion domestic investment and noted that results were already visible. Shares of Apple surged more than 5% after the announcement, with analysts noting that while supply chain adjustments would take time, the pledge might help the company secure lighter treatment under U.S. trade policy.",
    "reporter": "The Hindu",
    "date": "2025-08-04 13:30",
    "image": "6.webp",
    "votes": {
      "real": 27,
      "fake": 12
    },
    "comments": []
  },
  {
    "id": 7,
    "headline": "Intel Shares Rise as SoftBank Invests $2 Billion",
    "details": "Intel shares jumped after SoftBank announced a $2 billion stake in the U.S. chipmaker. The move followed reports that the Trump administration was considering a 10% government stake in Intel to support its Ohio manufacturing hub. The deal, valued at $23 per share, was seen as a lifeline for Intel, which had been struggling against competitors like Samsung and TSMC. Analysts noted that the U.S. government’s involvement could reshape the private sector, raising concerns about political influence over companies. The investment reinforced Intel’s importance as one of the few U.S. firms capable of large-scale semiconductor manufacturing, especially for national security and AI applications.",
    "reporter": "Economic Times",
    "date": "2025-08-05 08:15",
    "image": "7.webp",
    "votes": {
      "real": 84,
      "fake": 12
    },
    "comments": []
  },
  {
    "id": 8,
    "headline": "Trump’s Tariffs Challenge Scottish Imports",
    "details": "U.S. tariffs on Scottish goods tested consumer demand for imported products. Scottish Gourmet USA, a business in North Carolina, increased prices on items such as shortbread, bacon, pies, and cheese due to a 10% tariff and higher costs for healthcare and supplies. Consumers faced higher prices, with Scottish shortbread reaching $10 per box compared to U.S.-made alternatives at $5-6. The tariffs risked reducing exports from companies like Walker's in Scotland, which employed thousands seasonally, while benefiting U.S. producers such as Mondelez, maker of Lorna Doone cookies. Tariffs also hurt U.S. automakers like GM and Ford, which relied on international supply chains. Toyota and Honda reported billions in additional costs, while Caterpillar estimated losses of $1 billion annually.",
    "reporter": "Financial Times",
    "date": "2025-08-05 12:50",
    "image": "8.webp",
    "votes": {
      "real": 44,
      "fake": 19
    },
    "comments": []
  },
  {
    "id": 9,
    "headline": "Bolivia’s Economic Woes Ahead of Elections",
    "details": "Bolivia prepared for general elections amid severe economic challenges. Inflation surged to 24% in June, driven by falling natural gas production, reduced exports, and shortages of U.S. dollars. The decline created fuel and food shortages, sparking protests across the country. Citizens described the rising cost of living as unsustainable, with families cutting back on eating out and spending hours in petrol queues. The Bolivian government had long subsidized fuel, but dwindling revenues made the subsidies increasingly difficult to sustain. Outgoing President Luis Arce blamed parliament for blocking loans, while opponents accused him of mismanagement. Analysts predicted that the next government would face unpopular structural reforms, as the state-heavy economic model appeared unsustainable.",
    "reporter": "NDTV",
    "date": "2025-08-06 09:40",
    "image": "9.webp",
    "votes": {
      "real": 29,
      "fake": 18
    },
    "comments": []
  },
  {
    "id": 10,
    "headline": "Volkswagen Introduces Subscription for Car Power",
    "details": "Volkswagen launched a subscription model for UK customers to unlock extra engine power in its ID.3 electric cars. The power upgrade cost £16.50 per month, £165 annually, or £649 for lifetime access tied to the vehicle. VW positioned the option as consumer choice, comparing it to traditional petrol and diesel cars with different power configurations. However, some customers criticized the model, arguing that features already present in cars should not require additional payment. Other automakers, including BMW and Mercedes, had introduced similar subscription models, but surveys showed consumer willingness to pay for in-car services had fallen, despite the overall growth of the global subscription economy.",
    "reporter": "CNN News",
    "date": "2025-08-06 14:25",
    "image": "10.webp",
    "votes": {
      "real": 20,
      "fake": 9
    },
    "comments": []
  },
  {
    "id": 11,
    "headline": "Intel Shares Surge on Reports of Possible U.S. Stake",
    "details": "Intel's stock rose more than 7% after reports suggested the Trump administration was considering buying a stake in the company to support its Ohio chip hub. Analysts viewed the move as a potential lifeline for Intel, which had struggled in the AI race. Although details of the deal remained unclear, experts noted that the U.S. government rarely supported individual firms directly. However, Intel's strategic role in semiconductor manufacturing made it a special case. The Ohio plant was envisioned as the world's largest chip facility but had faced repeated delays. Analysts warned that government involvement could set a concerning precedent of political influence over corporate strategy, though many agreed Intel remained vital to U.S. national security interests.",
    "reporter": "Reporter Zaw",
    "date": "2025-08-04 20:00",
    "image": "11.webp",
    "votes": {
      "real": 22,
      "fake": 0
    },
    "comments": []
  },
  {
    "id": 12,
    "headline": "Shein’s UK Sales Surge to £2 Billion",
    "details": "Fast-fashion giant Shein reported UK sales of £2 billion, up 32.3% in 2024, with profits rising 57%. The growth came despite inflationary pressures and rising living costs. The company faced potential risks from changes in UK tax exemptions for imports under £135 and from U.S. tariffs after Trump removed tax breaks on low-value packages. Shein expanded its UK presence with new offices, a Liverpool pop-up shop, and a Christmas bus tour across 12 cities. However, it continued to face criticism over labor conditions in Chinese factories and environmental impacts.",
    "reporter": "Anonymous",
    "date": "2025-08-03 17:15",
    "image": "12.webp",
    "votes": {
      "real": 10,
      "fake": 2
    },
    "comments": []
  },
  {
    "id": 13,
    "headline": "UK Economic Growth Slows but Exceeds Forecasts",
    "details": "The UK economy grew by 0.3% between April and June, slowing from 0.7% in the first quarter but still exceeding expectations of near stagnation. Growth was driven by services and construction, while retail dragged performance. Chancellor Rachel Reeves highlighted the results as exceeding forecasts but acknowledged that further work was needed to ensure inclusive growth. Analysts noted that resilience in the economy could delay Bank of England interest rate cuts, with inflation expected to peak at 4% before gradually returning to target levels.",
    "reporter": "Reporter Nyein",
    "date": "2025-08-02 08:50",
    "image": "13.webp",
    "votes": {
      "real": 14,
      "fake": 1
    },
    "comments": []
  },
  {
    "id": 14,
    "headline": "Australia’s Rare Earth Strategy Against China",
    "details": "Australia committed $1 billion to support rare earth mining in Eneabba, Western Australia, aiming to reduce dependence on China, which controlled more than 80% of global supply. Mining company Iluka Resources planned to build a refinery to process dysprosium and terbium, byproducts of zircon extraction. Analysts emphasized that rare earths were essential for electric vehicles, renewable energy, and defense technologies. Australia sought to provide a cleaner and more reliable supply, though environmental concerns remained over radioactive byproducts of refining. The move reflected growing global urgency after China used its rare earth monopoly as leverage during trade disputes.",
    "reporter": "Reporter Thura",
    "date": "2025-08-01 07:40",
    "image": "14.webp",
    "votes": {
      "real": 11,
      "fake": 4
    },
    "comments": []
  },
  {
    "id": 15,
    "headline": "Markets Await U.S. Federal Reserve Decision",
    "details": "Asian markets traded lower ahead of the U.S. Federal Reserve’s interest rate announcement. The Nikkei 225 fell 1%, and the Hang Seng Index dropped 0.9%, while Korea’s Kospi rose 0.5%. Australia’s S&P/ASX 200 remained stable, and China’s CSI 300 was flat. Investors also monitored U.S.–China trade talks and European market reactions to a new U.S.–EU trade agreement.",
    "reporter": "Reporter Win",
    "date": "2025-07-31 15:10",
    "image": "15.jpg",
    "votes": {
      "real": 12,
      "fake": 5
    },
    "comments": []
  },
  {
    "id": 16,
    "headline": "Global Stocks React to U.S. Inflation Data",
    "details": "Global stocks edged lower after unexpectedly strong U.S. inflation data challenged expectations of Federal Reserve rate cuts. Treasury yields rose as markets reassessed future monetary policy. The S&P 500 achieved a modest gain, while the Dow Jones and Nasdaq ended flat. Analysts noted that inflation concerns continued to unsettle investors despite record highs in some indices.",
    "reporter": "Reporter Ei",
    "date": "2025-07-30 12:00",
    "image": "16.webp",
    "votes": {
      "real": 19,
      "fake": 2
    },
    "comments": []
  },
  {
    "id": 17,
    "headline": "State Street Rebrands Global Advisors Division",
    "details": "State Street announced a rebrand of its Global Advisors division, renaming it State Street Investment Management. The change aimed to strengthen collaboration within the corporation and expand offerings for global investors. CEO Yie-Hsin Hung emphasized the company’s mission of delivering tailored solutions and prioritizing partnerships as part of its 'One State Street' strategy.",
    "reporter": "Reporter Myint",
    "date": "2025-07-29 09:25",
    "image": "17.jpg",
    "votes": {
      "real": 20,
      "fake": 1
    },
    "comments": []
  },
  {
    "id": 18,
    "headline": "Santos Buyout Deal Faces Delays",
    "details": "Australian gas producer Santos confirmed delays in finalizing an $18.7 billion buyout led by Abu Dhabi National Oil Company (ADNOC). The consortium requested more time beyond the exclusive due diligence deadline to secure approvals. Shares in Santos fell 3.5% amid investor concerns over the deal’s future. If completed, the transaction would represent the largest all-cash corporate buyout in Australian history.",
    "reporter": "CNN News",
    "date": "2025-08-10 14:00",
    "image": "18.jpg",
    "votes": {
      "real": 75,
      "fake": 20
    },
    "comments": []
  },
  {
    "id": 19,
    "headline": "U.S. Trade Talks with India Paused",
    "details": "The U.S. postponed scheduled trade negotiations with India, originally set for late August in New Delhi. Sources indicated that the talks, ongoing since February, would be rescheduled for a later date. The pause came as India faced the highest U.S. tariffs worldwide, with a 50% levy on its goods. Traders had already begun paying a 25% tariff, with the remainder set to take effect on 27 August.",
    "reporter": "CNN News",
    "date": "2025-08-10 13:00",
    "image": "19.webp",
    "votes": {
      "real": 34,
      "fake": 25
    },
    "comments": []
  },
  {
    "id": 20,
    "headline": "South Korea–U.S. Trade Deal Issues Ahead of Summit",
    "details": "As South Korea and the U.S. prepared for a summit, unresolved issues from a recent trade deal created potential for disputes. Analysts suggested that President Trump might seek further concessions on defense costs and investments. The absence of a binding written agreement heightened risks of disagreement, with conflicting reports already emerging from both sides. Observers warned that even formal deals like free trade agreements could be subject to reversal under current conditions.",
    "reporter": "CNN News",
    "date": "2025-08-10 13:00",
    "image": "20.jpg",
    "votes": {
      "real": 45,
      "fake": 4
    },
    "comments": []
  },
  {
    "id": 21,
    "headline": "Nakamura Closes In On 50th Bullet Brawl Title With Commanding Victory",
    "details": "GM Hikaru Nakamura moved closer to an unprecedented 50 Bullet Brawl titles after claiming his 46th victory. He opened the event with a near perfect 21.5/22 run and finished with 175 points, 27 ahead of GM Oleksandr Bortnyk and seven more than GM Andrew Tang. FM Dincer Tasdogen took fourth place. The prize distribution awarded Nakamura 400 dollars, Bortnyk 250 dollars, Tang 150 dollars, and Tasdogen 100 dollars, while WIM Mitra Asgharzadeh won the 100 dollar best womens prize with a 16th place finish. The next edition of Bullet Brawl will be held on Saturday, August 23.",
    "reporter": "Chess.com News",
    "date": "2025-08-11 09:30",
    "image": "21.png",
    "votes": {
      "real": 83,
      "fake": 14
    },
    "comments": []
  },
  {
    "id": 22,
    "headline": "Aronian Wins Saint Louis Rapid & Blitz With 2 Rounds To Spare",
    "details": "GM Levon Aronian secured the 2025 Saint Louis Rapid and Blitz title with two rounds remaining after consistent performances in the blitz portion. GM Fabiano Caruana finished second despite showing strong form in the rapid but faltering with costly blunders in the blitz rounds. GM Maxime Vachier Lagrave placed third and now leads the Grand Chess Tour standings heading into the Sinquefield Cup. World Champion Gukesh Dommaraju had a disappointing finish and now faces the challenge of winning the Sinquefield Cup to qualify for the Grand Chess Tour Finals in Brazil. Aronian's victory was highlighted by wins against Caruana in both blitz games, which effectively sealed his triumph.",
    "reporter": "Saint Louis Chess Club",
    "date": "2025-08-11 13:00",
    "image": "22.png",
    "votes": {
      "real": 71,
      "fake": 22
    },
    "comments": []
  },
  {
    "id": 23,
    "headline": "Carlsen Loses Battle, Wins War Over Nakamura In Freestyle Friday",
    "details": "GM Magnus Carlsen captured victory in Freestyle Friday on August 15 by winning on tiebreaks against GM Hikaru Nakamura. Both scored 10 points, but Carlsen edged ahead due to superior tiebreaks despite losing their direct encounter. This marked Carlsen's first Freestyle Friday win since the event launched in January 2025. Nakamura's earlier win against Carlsen had briefly put him in the lead, but Carlsen's four game win streak solidified his top two standing and gave him the overall victory.",
    "reporter": "ChessBase",
    "date": "2025-08-12 10:20",
    "image": "23.png",
    "votes": {
      "real": 64,
      "fake": 17
    },
    "comments": []
  },
  {
    "id": 24,
    "headline": "Hou Wins Thriller To Advance To WSCC Semifinals",
    "details": "GM Hou Yifan overcame GM elect Divya Deshmukh in one of the closest matches of the Womens Speed Chess Championship season. Divya started impressively, employing sacrifices and bold play to take a two point lead. Hou, however, showed resilience and mounted a comeback, eventually forcing the match into an armageddon tiebreak. Hou prevailed in the final game to advance to the semifinals. The next quarterfinal will feature IM Polina Shuvalova against IM Alice Lee.",
    "reporter": "FIDE News",
    "date": "2025-08-12 11:45",
    "image": "24.png",
    "votes": {
      "real": 56,
      "fake": 13
    },
    "comments": []
  },
  {
    "id": 25,
    "headline": "Keymer Enters World Top-10 For 1st Time",
    "details": "GM Vincent Keymer reached a career milestone by breaking into the worlds top 10 with a victory over GM Awonder Liang in round seven of the Quantbox Chennai Grand Masters 2025. GM Arjun Erigaisi and GM Karthikeyan Murali shared second place after scoring important results, while GM Nihal Sarin defeated GM Ray Robson. GM Jorden van Foreest missed a chance to beat GM Pranav Venkatesh in a queen endgame. In the Challengers, GMs Pranesh M and Leon Luke Mendonca rose to joint leadership after beating GMs Vaishali Rameshbabu and Diptayan Ghosh, leaving GM Abhimanyu Puranik half a point behind.",
    "reporter": "Chess.com India",
    "date": "2025-08-12 15:00",
    "image": "25.png",
    "votes": {
      "real": 49,
      "fake": 9
    },
    "comments": []
  },
  {
    "id": 26,
    "headline": "Carlsen's Near Perfection Costs Nakamura Sweep",
    "details": "In Titled Tuesday on August 12, GMs Hikaru Nakamura and Magnus Carlsen split victories across the two tournaments. Nakamura won the early event on tiebreaks after defeating GM Oleksandr Bortnyk in the final round, while Carlsen dominated the later event with a 10.5 out of 11 score. His performance included a crucial win over Nakamura, who was otherwise undefeated. This marked Nakamura's 90th Titled Tuesday win since 2020 and Carlsen's 35th, 10 of which have come in 2025.",
    "reporter": "Lichess News",
    "date": "2025-08-13 09:20",
    "image": "26.png",
    "votes": {
      "real": 77,
      "fake": 11
    },
    "comments": []
  },
  {
    "id": 27,
    "headline": "Magnus Carlsen Wins 1st Ever Chess Esports World Cup",
    "details": "Magnus Carlsen became the first Chess Esports World Cup Champion by defeating GM Alireza Firouzja in the Grand Final. Carlsen won the last three games to secure the 250,000 dollar top prize and also helped Team Liquid claim the overall championship. GM Hikaru Nakamura took third place after narrowly defeating GM Arjun Erigaisi in a match where almost every game ended decisively.",
    "reporter": "Esports Insider",
    "date": "2025-08-13 13:40",
    "image": "27.png",
    "votes": {
      "real": 62,
      "fake": 16
    },
    "comments": []
  },
  {
    "id": 28,
    "headline": "Lauri Markkanen Dominates Poland in EuroBasket Prep Game",
    "details": "Finnish star Lauri Markkanen delivered a dominant performance with 42 points and 12 rebounds in just 24 minutes during a EuroBasket 2025 warm up game against Poland. Over three summer preparation games, the 28 year old has averaged 40.3 points and 8.3 rebounds while maintaining strong shooting percentages. His teammates Olivier Nkamhoua, Sasu Salin, and Mikael Jantunen also contributed to Finland's victory.",
    "reporter": "EuroHoops",
    "date": "2025-08-14 09:00",
    "image": "28.jpg",
    "votes": {
      "real": 81,
      "fake": 19
    },
    "comments": []
  },
  {
    "id": 29,
    "headline": "Luka Doncic Injury Scare Resolved",
    "details": "Luka Doncic briefly alarmed fans when he appeared injured during Slovenia's friendly game against Latvia. However, the Slovenian Basketball Federation confirmed that he had avoided serious harm. Doncic immediately rejoined the national team and will continue practicing as Slovenia prepares for its next matchup against Great Britain.",
    "reporter": "ESPN",
    "date": "2025-08-14 13:20",
    "image": "29.jpg",
    "votes": {
      "real": 65,
      "fake": 10
    },
    "comments": []
  },
  {
    "id": 30,
    "headline": "France Finalizes EuroBasket 2025 Roster",
    "details": "France announced its final 12 man roster for EuroBasket 2025, led by NBA players Guerschon Yabusele, Bilal Coulibaly, Zaccharie Risacher, and Alex Sarr. Vincent Poirier was excluded due to injury, while Nadir Hifi did not make the cut. Several big names, including Victor Wembanyama, Rudy Gobert, Evan Fournier, and Mathias Lessort, are unavailable due to health issues. Nicolas Batum and Nando De Colo retired from international basketball following the Paris 2024 Olympics. France will compete in Group D in Katowice, Poland, facing Belgium, Slovenia, Israel, Poland, and Iceland.",
    "reporter": "L'Équipe",
    "date": "2025-08-14 16:00",
    "image": "30.jpg",
    "votes": {
      "real": 59,
      "fake": 15
    },
    "comments": []
  },
  {
    "id": 31,
    "headline": "NBA Fans Criticize NBCs 11 PM Doubleheader Schedule",
    "details": "NBC introduced Coast 2 Coast Tuesday for the 2025 26 NBA season, scheduling the second game of weekly doubleheaders to tip off at 11 PM ET. Fans expressed frustration, particularly those on the East Coast, noting that commercial breaks could push games closer to 11:30 PM starts. The first affected matchup will be the Golden State Warriors against the Los Angeles Clippers on October 28.",
    "reporter": "NBC Sports",
    "date": "2025-08-15 08:30",
    "image": "31.jpg",
    "votes": {
      "real": 68,
      "fake": 9
    },
    "comments": []
  },
  {
    "id": 32,
    "headline": "NBA 2K26 Reveals Top 3-Point and Mid-Range Ratings",
    "details": "Ahead of the full NBA 2K26 player ratings release, 2K Games revealed the top three point and mid range shooting specialists. Stephen Curry topped the three point list with a near perfect 99 rating, followed by Kevin Durant and Klay Thompson. For mid range shooting, Nikola Jokic and Kyrie Irving shared the top spot at 98, with Kevin Durant, Devin Booker, Shai Gilgeous Alexander, Andrew Nembhard, and Curry closely behind at 97. NBA 2K26 will release on September 5, 2025.",
    "reporter": "IGN",
    "date": "2025-08-15 11:15",
    "image": "32.jpg",
    "votes": {
      "real": 74,
      "fake": 18
    },
    "comments": []
  },
  {
    "id": 33,
    "headline": "Bryn Forbes Signs With Greek Club Aris Thessaloniki",
    "details": "Former NBA guard Bryn Forbes signed a one year contract with Aris Thessaloniki for the 2025 26 season. The 31 year old spent seven years in the NBA with teams including the San Antonio Spurs and Milwaukee Bucks, averaging 8.6 points per game across 473 appearances. His best season came in 2018 19 with the Spurs. Forbes, who faced legal issues in recent years, played in Puerto Rico before moving to Greece.",
    "reporter": "EuroLeague News",
    "date": "2025-08-15 14:40",
    "image": "33.jpg",
    "votes": {
      "real": 58,
      "fake": 7
    },
    "comments": []
  },
  {
    "id": 34,
    "headline": "Hornets Moussa Diabate Declines France Call-Up",
    "details": "Charlotte Hornets center Moussa Diabate declined an invitation to join France for EuroBasket 2025. He had been asked to replace the injured Vincent Poirier but opted to focus on his NBA career. Head coach Frederic Fauthoux confirmed Diabate's decision, emphasizing the importance of respecting players who participated in summer preparations. France enters the tournament short handed in the center position, with Victor Wembanyama, Rudy Gobert, Mathias Lessort, and Poirier all unavailable.",
    "reporter": "Bleacher Report",
    "date": "2025-08-16 09:30",
    "image": "34.jpg",
    "votes": {
      "real": 69,
      "fake": 14
    },
    "comments": []
  },
  {
    "id": 35,
    "headline": "Stephen Curry Stays Calm Despite Quiet Warriors Offseason",
    "details": "Golden State Warriors star Stephen Curry expressed confidence in his team's core despite the lack of offseason moves. The Warriors have not made any signings or trades while dealing with restricted free agent Jonathan Kuminga's contract situation. Curry believes the roster remains competitive but acknowledged the need for additional support to reach the next level. He enters his 17th NBA season after averaging 24.5 points, 4.4 rebounds, and 6.0 assists last year.",
    "reporter": "The Athletic",
    "date": "2025-08-16 12:10",
    "image": "35.jpg",
    "votes": {
      "real": 63,
      "fake": 11
    },
    "comments": []
  },
  {
    "id": 36,
    "headline": "Juli Inkster Nearly Makes LPGA History",
    "details": "Hall of Famer Juli Inkster, at age 65, nearly became the oldest player to make an LPGA cut at the Standard Portland Classic. After opening with a strong 69, she finished with a 74 and missed the cut by one stroke. Inkster last played an LPGA event in 2022 and joined the field to prepare for the U.S. Senior Womens Open. Despite falling short, she expressed satisfaction with competing alongside younger players and will continue her preparations.",
    "reporter": "Golf Digest",
    "date": "2025-08-17 10:20",
    "image": "36.jpg",
    "votes": {
      "real": 55,
      "fake": 8
    },
    "comments": []
  },
  {
    "id": 37,
    "headline": "Rasmus Hojgaard Leads Danish Golf Championship",
    "details": "Rasmus Hojgaard held his nerve to lead the Danish Golf Championship by one shot at 13 under. The 24 year old Dane birdied the 17th to pull ahead after pressure from Marco Penge, who briefly overtook him earlier in the round. Ben Schmidt climbed into contention with a course record 64, while Swedens Mikael Lindberg recorded a hole in one. Hojgaard, who won the event in 2023, is also in contention for a Ryder Cup spot.",
    "reporter": "Sky Sports Golf",
    "date": "2025-08-17 13:00",
    "image": "37.jpg",
    "votes": {
      "real": 72,
      "fake": 20
    },
    "comments": []
  },
  {
    "id": 38,
    "headline": "Sebastian Munoz Shoots 59 at LIV Golf Indianapolis",
    "details": "Sebastian Munoz carded a remarkable 12 under 59 at the LIV Golf event in Indianapolis, becoming the third player in the leagues short history to break 60. His round included a rare double bogey but was fueled by 13 birdies over 14 holes. Munoz joined Joaquin Niemann and Bryson DeChambeau as the only LIV players to achieve sub 60 rounds.",
    "reporter": "LIV Golf News",
    "date": "2025-08-18 09:15",
    "image": "38.jpg",
    "votes": {
      "real": 66,
      "fake": 18
    },
    "comments": []
  },
  {
    "id": 39,
    "headline": "Robert MacIntyre Leads BMW Championship After Opening 62",
    "details": "Robert MacIntyre surged into the lead at the BMW Championship with an 8 under 62, powered by six consecutive birdies to close his round. His performance marked the best putting stretch of his season, including long makes from 65 and 40 feet. Tommy Fleetwood, Scottie Scheffler, and Rickie Fowler remained within striking distance heading into the next round.",
    "reporter": "PGA Tour News",
    "date": "2025-08-18 13:30",
    "image": "39.jpg",
    "votes": {
      "real": 61,
      "fake": 12
    },
    "comments": []
  },
  {
    "id": 40,
    "headline": "Brooke Henderson One Shot Behind at Portland Classic",
    "details": "Brooke Henderson opened the Standard Portland Classic with a 7 under 65, leaving her one shot behind leader Adela Cernousek. Henderson, who won the event in 2015 and 2016, birdied all four par 5s and relied on accurate driving to stay in contention. Despite a recent dip in form, she remains a strong contender as she seeks her 14th LPGA Tour title.",
    "reporter": "LPGA News",
    "date": "2025-08-19 09:45",
    "image": "40.jpg",
    "votes": {
      "real": 70,
      "fake": 21
    },
    "comments": []
  },
  {
    "id": 41,
    "title": "Demon Slayer: Kimetsu no Yaiba Infinity Castle Takes 4th Place in Japan All-Time Box Office Chart in One Month",
    "details": "Demon Slayer: Kimetsu no Yaiba Infinity Castle has quickly become one of the highest-grossing films in Japanese history. In just 31 days, the movie collected 25.78 billion yen (approximately 174.32 million US dollars) through ticket sales of more than 18.27 million.\n\nDuring the Obon holiday, the film climbed from sixth to fourth place on Japan’s all-time box office chart, surpassing Frozen and displacing Your Name from the top five for the first time since 2016. Infinity Castle now trails only Titanic, which earned 27.7 billion yen in 1997, along with the anime titans Spirited Away and Mugen Train.\n\nInfinity Castle is also now the third-highest-grossing anime film of all time in Japan. Its rapid success demonstrates the continued strength of the Demon Slayer franchise, which has captivated audiences with striking animation and emotionally intense storytelling.",
    "date": "2025-08-12",
    "reporter": "BBC News",
    "image": "41.jpg",
    "votes": {
      "real": 324,
      "fake": 87
    }
  },
  {
    "id": 42,
    "title": "Box Office: Superman and F1 Each Nearing $600 Million Milestone",
    "details": "The global box office has been dominated by a race between Superman and F1, two blockbuster titles that are each nearing the $600 million mark.\n\nSuperman, directed by James Gunn, has proven to be the stronger film domestically, earning $340 million in North America. After six weeks in theaters, its global gross reached $595 million. Despite expectations that it will not surpass the $670 million figure achieved by 2013’s Man of Steel, Superman’s box office performance marks a step forward for DC Studios, which has been searching for consistency in its cinematic output.\n\nMeanwhile, F1 has displayed notable endurance, particularly in international markets. With a worldwide gross of $590 million after eight weeks, including $407 million overseas, the film has surprised many analysts with its ability to hold strong against stiff competition.\n\nThis box office race has highlighted shifting trends in global cinema, where international markets are increasingly decisive in determining a film’s success.",
    "date": "2025-08-13",
    "reporter": "CNN News",
    "image": "42.jpg",
    "votes": {
      "real": 317,
      "fake": 288
    }
  },
  {
    "id": 43,
    "title": "How The Fantastic Four: First Steps Brought the Baxter Building to Life",
    "details": "The Fantastic Four: First Steps is Marvel Studios’ reimagining of the legendary superhero team in a world unlike any other previously seen in the MCU.\n\nThe story takes place in Earth-828, an alternate dimension steeped in retro-futuristic aesthetics inspired by the 1960s. The New York of Earth-828 features flying cars, gleaming skyscrapers, and the iconic Baxter Building, home to Reed Richards, Sue Storm, Johnny Storm, and Ben Grimm.\n\nProduction designer Kasra Farahani, who had earlier worked on Loki, spearheaded the creative direction of this new world. Drawing from architectural masters like Eero Saarinen and Oscar Niemeyer, as well as sci-fi works like 2001: A Space Odyssey, Farahani crafted an environment that balances sleek sophistication with whimsical futuristic flair. Comic book artist Jack Kirby’s classic designs, alongside illustrations by Syd Mead and John Berkey, further influenced the project.\n\nThe Baxter Building’s penthouse, central to the film, was designed as both a futuristic marvel and a warm family space. The film’s aesthetic merges imaginative fantasy with grounded architectural realism, creating a fresh yet nostalgic tone for the team’s MCU debut.",
    "date": "2025-08-14",
    "reporter": "Reuters",
    "image": "43.jpg",
    "votes": {
      "real": 469,
      "fake": 91
    }
  },
  {
    "id": 44,
    "title": "Omniscient Reader: The Prophet Draws Mixed Results at the Box Office",
    "details": "Omniscient Reader: The Prophet, an adaptation of the popular webtoon, faced a turbulent release filled with skepticism and criticism. Changes to character portrayals, controversial casting choices, and questionable cinematography drew significant backlash before its debut.\n\nDespite these challenges, the film attracted strong audiences at first. On July 25, it recorded 80,734 admissions, securing the number one spot at the box office that day. By July 26, total attendance had climbed to 281,263.\n\nHowever, sustaining momentum has proven difficult. Attendance dropped 40% on its second day, casting doubt on the movie’s ability to reach its break-even point of six million admissions. Audience reactions have been mixed. Fans of the original webtoon expressed frustration at the deviations, while newcomers to the story described the film as enjoyable and accessible.\n\nThe broader challenge lies in South Korea’s declining movie theater attendance. In 2025, cinema admissions reached their lowest in over two decades, making box office success harder to achieve. While the film leads the box office in its early days, the path to profitability remains uncertain.",
    "date": "2025-08-15",
    "reporter": "Al Jazeera",
    "image": "44.jpg",
    "votes": {
      "real": 361,
      "fake": 222
    }
  },
  {
    "id": 45,
    "title": "Lord of Mysteries’ Donghua Planned Until 2035",
    "details": "The donghua adaptation of Lord of Mysteries has announced long-term plans that will carry the project through to 2035.\n\nThe show initially struggled with rushed pacing, delays in dubbing, and confusion among audiences, but has since found its rhythm. English-dubbed episodes are being released alongside explanatory segments featuring Old Neil, a character who helps break down complex storylines for new viewers.\n\nThe series has been approved for six to seven additional seasons, concluding with a feature film that will wrap up the journey of The Fool. Season two, slated for 2027, will expand to over 30 episodes and maintain high-quality production values.\n\nIn addition to its main seasons, the series plans to release special episodes that adapt entire arcs from the web novel, potentially running longer than standard episodes. The first of these special releases is expected in 2026, accompanied by a promotional trailer.\n\nWith a roadmap spanning more than a decade, Lord of Mysteries has committed to a faithful adaptation of its expansive source material.",
    "date": "2025-08-16",
    "reporter": "The Guardian",
    "image": "45.jpg",
    "votes": {
      "real": 427,
      "fake": 162
    }
  },
  {
    "id": 46,
    "title": "Luminate Report Highlights Power of Superfans; Eminem Exemplifies the Trend",
    "details": "The Luminate Midyear Music Report underscored the growing importance of superfans in the modern music industry. These listeners, who go beyond casual streaming to purchase merchandise, event tickets, and subscriptions, now drive a significant portion of industry revenue.\n\nEminem exemplifies this phenomenon, with his devoted fanbase—often called “Stans”—embodying the passion and loyalty described in the report. His fans dissect lyrics, collect memorabilia, and support his work across platforms, making them a cornerstone of his enduring success.\n\nThe release of Stans, a documentary about his fandom, reflects a broader shift in how artists are beginning to view their most dedicated followers. Rather than background noise, superfans are being recognized as vital contributors to long-term sustainability in the industry.",
    "date": "2025-08-17",
    "reporter": "BBC News",
    "image": "46.jpg",
    "votes": {
      "real": 352,
      "fake": 86
    }
  },
  {
    "id": 47,
    "title": "The Eminem Show Surpasses 8.7 Billion Streams on Spotify",
    "details": "Eminem’s 2002 classic, The Eminem Show, has surpassed 8.7 billion streams on Spotify, making it his most-played album to date. Averaging 3.5 million streams daily, the album continues to dominate his catalog more than two decades after its release.\n\nThe album was a commercial powerhouse upon release, debuting at number one on the Billboard 200 despite a leak and selling 1.3 million copies in its first full week. Certified Diamond in both the United States and Canada, with over 27 million physical copies sold worldwide, it remains the best-selling hip-hop album of all time. Its streaming performance ensures its legacy continues to grow in the digital age.",
    "date": "2025-08-18",
    "reporter": "CNN News",
    "image": "47.jpg",
    "votes": {
      "real": 469,
      "fake": 135
    }
  },
  {
    "id": 48,
    "title": "Eminem Reflects on Writing Stan",
    "details": "Eminem has shared insights into his mindset when writing the iconic track Stan. Living at his then-partner’s mother’s house at the time, he found himself suddenly grappling with the weight of fame and the idea of influencing fans as deeply as his own idols had influenced him.\n\nHe explained that the surreal experience of realizing he had become a figure of obsession inspired the narrative of Stan. While it was a disturbing concept to embody the perspective of a fan consumed by fixation, the song was rooted in real experiences of meeting admirers who viewed him as larger-than-life.\n\nThe song’s layers, blending satire, reality, and commentary on celebrity culture, contributed to its lasting impact. It continues to be studied as one of the most significant hip-hop tracks of all time.",
    "date": "2025-08-19",
    "reporter": "Reuters",
    "image": "48.jpg",
    "votes": {
      "real": 357,
      "fake": 123
    }
  },
  {
    "id": 49,
    "title": "Eminem’s Venom Surpasses 900 Million Streams",
    "details": "Eminem’s track Venom, created for the 2018 film of the same name, has surpassed 900 million streams on Spotify. Featured as the second single on his Kamikaze album, it has become the album’s most-streamed track by a wide margin.\n\nThe song has achieved Gold or higher certification in 13 countries, including 4× Platinum status in Australia. Its longevity highlights the strong connection between Eminem’s music and major film franchises.",
    "date": "2025-08-20",
    "reporter": "Al Jazeera",
    "image": "49.jpg",
    "votes": {
      "real": 401,
      "fake": 236
    }
  },
  {
    "id": 50,
    "title": "Snoop Dogg Turns Smoked Blunts into $9,000 Art Pieces",
    "details": "Snoop Dogg has partnered with The Joint Venture to launch Ashes to Art, a project transforming his smoked blunts into one-of-a-kind artworks. Each piece is preserved in resin, pigment, and glitter, and signed by the rapper, with prices beginning at $9,000.\n\nCreated by artist Erica Kovitz, the collection pushes the boundaries of what can be considered art while embracing Snoop Dogg’s legacy. The centerpiece, Snoop Doggy Dogg Genesis Burn, incorporates his 1993 LAPD mugshot and retired autograph, attracting bids as high as $70,000.",
    "date": "2025-08-11",
    "reporter": "The Guardian",
    "image": "50.jpg",
    "votes": {
      "real": 393,
      "fake": 79
    }
  },
  {
    "id": 51,
    "title": "Snoop Dogg Plans Burger Van at Celtic Park",
    "details": "Snoop Dogg has expressed his desire to set up a burger van at Celtic Football Club’s stadium in Glasgow. He praised Celtic fans as the most passionate in European football and described the concept as turning the venue into a “foodie paradise.”\n\nHe emphasized the importance of preparation, insisting that quality ingredients and personal involvement in serving fans would make the burgers stand out.",
    "date": "2025-08-12",
    "reporter": "BBC News",
    "image": "51.jpg",
    "votes": {
      "real": 312,
      "fake": 91
    }
  },
  {
    "id": 52,
    "title": "Snoop Dogg Attends Paris Olympics in Full Equestrian Kit",
    "details": "At the Paris Olympics, Snoop Dogg appeared as a special correspondent dressed in full equestrian attire, including a tailcoat, breeches, hard hat, and sunglasses. Accompanied by Martha Stewart, he attended the dressage event at the Palace of Versailles.\n\nThe rapper’s enthusiastic presence brought attention and entertainment to the coverage, showcasing his quirky persona on the global stage.",
    "date": "2025-08-13",
    "reporter": "CNN News",
    "image": "52.jpg",
    "votes": {
      "real": 287,
      "fake": 104
    }
  },
  {
    "id": 53,
    "title": "Snoop Dogg Honored with Hollywood Walk of Fame Star",
    "details": "Snoop Dogg was honored with a star on the Hollywood Walk of Fame, attracting a massive crowd of fans and fellow musicians including Dr. Dre, Pharrell Williams, and Warren G.\n\nHe expressed gratitude to his collaborators and supporters but also highlighted his own perseverance and determination, crediting his success to his relentless dedication and refusal to quit.",
    "date": "2025-08-14",
    "reporter": "Reuters",
    "image": "53.jpg",
    "votes": {
      "real": 421,
      "fake": 78
    }
  },
  {
    "id": 54,
    "title": "HBO Reveals New Harry Potter Cast",
    "details": "HBO announced the main cast for its upcoming Harry Potter reboot series, promising a faithful adaptation of J.K. Rowling’s original novels. Dominic Mclaughlin will play Harry Potter, Arabella Stanton will portray Hermione Granger, and Alastair Stout will take on the role of Ron Weasley.\n\nThe reboot is intended to introduce the Wizarding World to a new generation of viewers while offering a more complete adaptation of the book series.",
    "date": "2025-08-15",
    "reporter": "The Guardian",
    "image": "54.jpg",
    "votes": {
      "real": 356,
      "fake": 92
    }
  },
  {
    "id": 55,
    "title": "Supergirl Film Confirmed",
    "details": "DC Studios has confirmed the upcoming release of Supergirl, directed by Craig Gillespie and written by Ana Nogueira. Milly Alcock will star as Kara Zor-El, with Matthias Schoenaerts, Eve Ridley, David Krumholtz, and Emily Beecham in supporting roles.\n\nThe film follows Supergirl on a quest for vengeance across the galaxy. Initially developed under the DCEU in 2018, the project was reimagined after James Gunn and Peter Safran assumed leadership of DC Studios. Filming took place in the UK and Scotland between January and May 2025, with release scheduled for June 26, 2026.",
    "date": "2025-08-16",
    "reporter": "BBC News",
    "image": "55.jpg",
    "votes": {
      "real": 389,
      "fake": 147
    }
  },
  {
    "id": 56,
    "title": "Wonder Woman Reboot in Development",
    "details": "James Gunn confirmed that DC Studios is actively developing a new Wonder Woman film. Unlike a direct sequel, the project will be a complete reboot, aiming to reset the character’s cinematic presence within the new DC Universe.\n\nThough no director or cast has been confirmed, the announcement signals a fresh approach. The film will stand alone and will not connect to previously announced projects such as the Paradise Lost prequel series.",
    "date": "2025-08-17",
    "reporter": "CNN News",
    "image": "56.jpg",
    "votes": {
      "real": 342,
      "fake": 113
    }
  },
  {
    "id": 57,
    "title": "Oppenheimer Surpasses $1 Billion at the Global Box Office",
    "details": "Christopher Nolan’s Oppenheimer has officially crossed the $1 billion mark at the worldwide box office, becoming the highest-grossing biographical film of all time. The film, which chronicles the life of J. Robert Oppenheimer and the development of the atomic bomb, has captivated audiences with its dramatic storytelling and meticulous attention to historical detail.\n\nOppenheimer has achieved critical acclaim, with particular praise for Cillian Murphy’s performance in the lead role. The film’s achievement highlights Nolan’s ability to deliver visually stunning and thought-provoking cinema that resonates with both critics and audiences. Its monumental box office performance underscores the continuing appeal of serious, adult-oriented dramas in an era dominated by superhero and franchise films.",
    "date": "2025-08-18",
    "reporter": "The Guardian",
    "image": "57.jpg",
    "votes": {
      "real": 478,
      "fake": 89
    }
  },
  {
    "id": 58,
    "title": "Twice to Bring K-Pop Spectacle to Bangkok",
    "details": "The globally popular K-pop group Twice has announced a highly anticipated concert in Bangkok as part of their ongoing world tour. The group, known for its vibrant performances and infectious hits, continues to draw massive crowds across Asia, North America, and Europe.\n\nFans in Thailand have long awaited the group’s return, and the upcoming performance is expected to sell out quickly. Twice’s concerts are celebrated for their high-energy choreography, dazzling stage production, and interactive moments with fans, known as “Once.”\n\nThe Bangkok concert not only highlights Thailand’s importance as a regional hub for K-pop fandom but also demonstrates the group’s enduring popularity nearly a decade into their career.",
    "date": "2025-08-19",
    "reporter": "BBC News",
    "image": "58.jpg",
    "votes": {
      "real": 395,
      "fake": 121
    }
  },
  {
    "id": 59,
    "title": "Stranger Things Final Season Generates Massive Buzz",
    "details": "The announcement of Stranger Things’ upcoming final season has generated enormous anticipation among fans worldwide. As one of Netflix’s flagship original series, Stranger Things has maintained cultural relevance since its 2016 debut, blending 1980s nostalgia with supernatural horror and heartfelt storytelling.\n\nThe final season promises to conclude the story of Eleven and her friends as they face their most dangerous challenge yet. Showrunners Matt and Ross Duffer have confirmed that the final episodes will tie together long-running mysteries surrounding the Upside Down, offering fans closure while delivering the show’s trademark mix of suspense and emotional depth.\n\nWith production underway, fans eagerly await teasers, trailers, and casting updates. The conclusion of Stranger Things marks the end of an era for Netflix, which is looking to cement the series’ legacy as one of its most influential hits.",
    "date": "2025-08-20",
    "reporter": "CNN News",
    "image": "59.jpg",
    "votes": {
      "real": 467,
      "fake": 134
    }
  },
  {
    "id": 60,
    "title": "Alice in Borderland Renewed for a Third Season",
    "details": "Netflix has confirmed the renewal of Alice in Borderland for a third season following the massive success of its second installment. The Japanese survival thriller, adapted from Haro Aso’s manga, has become one of the platform’s most popular non-English series.\n\nThe third season will continue the story of Arisu and Usagi as they navigate deadly games in a mysterious parallel Tokyo. The show’s blend of psychological tension, elaborate game design, and emotional character arcs has earned it critical praise and a growing international audience.\n\nProduction for the new season is expected to begin later this year, with the release anticipated in 2026. Netflix’s decision reflects the platform’s strategy to expand its roster of global hits by investing heavily in Asian content that resonates worldwide.",
    "date": "2025-08-21",
    "reporter": "Al Jazeera",
    "image": "60.jpg",
    "votes": {
      "real": 412,
      "fake": 97
    }
  },
  {
    "id": 61,
    "title": "Phuket Motorcyclist Killed at Coconut Grove Curve",
    "details": "A 41-year-old motorcyclist from Mai Khao, identified as Samreong, died after losing control of his black GPX Legend 250 at Phuket's infamous Coconut Grove Curve on Thepkasattri Road. The crash happened on August 7, when the victim struck the central median at high speed.\n\nPolice and emergency responders arrived promptly at 5:05 pm, but despite attempts at CPR, the man was pronounced dead at the scene. The crash caused heavy traffic delays until the wreckage was cleared, and his body was later transferred to Thalang Hospital for post-mortem examination.\n\nThe Coconut Grove Curve has long been feared by local riders, especially during Phuket's rainy season. Its sharp bend and uneven surface have been blamed for multiple fatalities over the years. Locals note that even experienced riders often misjudge the curve. The incident highlights Phuket's broader road safety crisis, where motorcycles account for the majority of deaths.",
    "date": "2025-08-07",
    "reporter": "CNN News",
    "image": "61.jpg:",
    "votes": {
      "real": 412,
      "fake": 87
    }
  },
  {
    "id": 62,
    "title": "Canadian Girl Drowns at Kata Beach in Phuket",
    "details": "Tragedy struck on August 7 when a 10-year-old Canadian girl drowned at Kata Beach in Phuket. The child had been swimming with her family when she was swept away by strong waves around 4:00 pm.\n\nRescue teams, including divers near Koh Tapu and beach searchers combing shallow waters, scoured the area. The family, who had arrived from Malaysia only a day earlier for a planned two-month holiday, watched as the search continued. Eventually, the girl's body was discovered near the spot where she disappeared.\n\nThe child reportedly suffered a facial wound, leading rescuers to believe she struck rocks beneath the water while drowning. Despite rough seas at the time, no red flags were posted on the beach to warn tourists. The incident has raised concerns over beach safety measures in Phuket, where swimming conditions can turn hazardous quickly.",
    "date": "2025-08-07",
    "reporter": "BBC News",
    "image": "62.webp",
    "votes": {
      "real": 387,
      "fake": 102
    }
  },
  {
    "id": 63,
    "title": "Thailand Approves Billions for Freight Train Upgrade",
    "details": "The Thai Cabinet has approved a 2.46-billion-baht plan to overhaul the nation's freight train system. The project will fund the procurement of 946 new container flatcars for the State Railway of Thailand (SRT).\n\nSRT Governor Veeris Ammarapala explained that the initiative aligns with the SRT's 2023-2027 roadmap and is part of the 2026 fiscal year priorities. Each flatcar will carry up to 62 tonnes, capable of transporting two containers of high-density cargo such as fertilizer, sugar, plastic pellets, and industrial salt.\n\nCurrently, only 308 of SRT's 1,062 freight cars can handle such loads. Once the new flatcars are operational, the nation's rail cargo handling capacity is expected to rise by 9 million tonnes annually, on top of the current 13 million tonnes.\n\nThe procurement also supports domestic industry, as the flatcars will be assembled in Thailand using both local and imported parts. The project is expected to strengthen Laem Chabang Port's role as the country's primary export hub. Delivery is scheduled between 2027 and 2032 in five batches.",
    "date": "2025-08-07",
    "reporter": "Reuters",
    "image": "63.jpg",
    "votes": {
      "real": 421,
      "fake": 78
    }
  },
  {
    "id": 64,
    "title": "Singaporean Tourist Arrested for Flying Drone in Pattaya",
    "details": "On August 7, authorities arrested a 44-year-old Singaporean tourist, Goh Chia Hsien, for flying a drone illegally over Walking Street in Pattaya.\n\nThe incident occurred shortly after midnight in the busy nightlife district, where drone operations are prohibited under Thailand's aviation laws. Pattaya City Special Affairs officers apprehended him, and he was later questioned at the Pattaya City Police Station with the assistance of an interpreter.\n\nThe suspect told police he was unaware of the restrictions and had been flying the drone for photography, describing himself as a drone enthusiast. However, he was unable to produce the required permit. Under the Aviation Act of 1954, unauthorized drone operations can lead to fines, imprisonment, or both.\n\nThe arrest underscores Thailand's strict enforcement of aviation safety rules, particularly in sensitive or crowded areas.",
    "date": "2025-08-07",
    "reporter": "CNN News",
    "image": "64.jpg",
    "votes": {
      "real": 354,
      "fake": 93
    }
  },
  {
    "id": 65,
    "title": "Police Dismantle Online Gambling Ring Worth 56 Million Baht",
    "details": "On August 6, Thai police raided a luxury home in Khlong Luang district, Pathum Thani province, uncovering a large-scale illegal gambling operation linked to Auto888vip.com.\n\nThe raid, led by the Technology Crime Suppression Division, resulted in the arrest of a 30-year-old man who managed the site's financial operations. Police confiscated assets worth 56 million baht, including a Mercedes-Benz CLS53, a BMW M4, luxury watches from Rolex and Patek Philippe, cash totaling 28 million baht, and designer clothing and jewelry.\n\nThe site reportedly generated around 20 million baht in revenue per month with 3,000 active accounts. Police are now pursuing additional suspects tied to the operation.\n\nThis bust is part of Thailand's ongoing crackdown on illegal online gambling, which authorities say fuels organized crime and drains billions from the economy.",
    "date": "2025-08-06",
    "reporter": "BBC News",
    "image": "65.jpg",
    "votes": {
      "real": 398,
      "fake": 86
    }
  },
  {
    "id": 66,
    "title": "Thai Police Raid Drone Manufacturing Company Over Violations",
    "details": "On August 5, officials from the National Broadcasting and Telecommunications Commission (NBTC) and the Crime Suppression Division raided a drone manufacturing company in Samut Prakan province.\n\nThe search uncovered numerous drones, anti-drone equipment, and frequency inspection vehicles. Authorities seized all equipment to verify permits and coordinated with customs officials to check for illegal imports.\n\nThe company is owned by a Singaporean national currently overseas, leaving its Thai caretaker responsible for questioning. Violations of the Radio Communications Act of 1955 carry penalties of up to five years in prison, fines of 100,000 baht, or both.\n\nNBTC emphasized the sensitivity of the current security situation, warning that the spread of unauthorized drone technology could threaten national security.",
    "date": "2025-08-05",
    "reporter": "Reuters",
    "image": "66.jpg",
    "votes": {
      "real": 365,
      "fake": 97
    }
  },
  {
    "id": 67,
    "title": "Decomposed Body of Tourist Found in Chiang Mai Forest",
    "details": "On August 3, a local resident collecting forest products stumbled upon the decomposed body of a foreign tourist in Chiang Mai's Doi Suthep forest. The body, believed to be that of a man, was found about two kilometers from the main road in Suthep subdistrict.\n\nDue to advanced decomposition, identification has proven difficult. A black backpack was found nearby, and the remains were transferred to Maharaj Nakorn Chiang Mai Hospital for forensic examination.\n\nPolice suspect the individual may have entered the forest alone, though the cause of death is still unknown. The challenging terrain and late hour complicated retrieval efforts.\n\nThis discovery comes amid a rise in tourist fatalities in Thailand, including the body of another foreign man found floating near Nui Beach in Phuket earlier this year.",
    "date": "2025-08-03",
    "reporter": "BBC News",
    "image": "67.jpg",
    "votes": {
      "real": 379,
      "fake": 88
    }
  },
  {
    "id": 68,
    "title": "Thai Provinces Unite to Tackle Drone Threats",
    "details": "On August 2, Lieutenant General Boonsin Phatklang, Commander of the 2nd Army Region, held a virtual meeting with governors from 20 northeastern provinces to discuss anti-drone measures.\n\nOfficials were instructed to procure counter-drone technology for use at critical locations such as airports, police stations, and armories. Patrols were also ordered to monitor for outsiders in sensitive areas, with suspects facing potential charges of espionage or terrorism, which can carry the death penalty.\n\nThe campaign reflects growing concerns over illegal drone activities, including their potential links to organized crime or cross-border operations.",
    "date": "2025-08-02",
    "reporter": "CNN News",
    "image": "68.jpg",
    "votes": {
      "real": 346,
      "fake": 79
    }
  },
  {
    "id": 69,
    "title": "Fire at Chon Buri Postal Warehouse",
    "details": "In the early hours of August 3, a fire broke out at a Thai Post warehouse in Phanat Nikhom, Chon Buri. Four residents were trapped inside but were rescued by firefighters after an hour-long battle with the flames.\n\nThe fire destroyed a large number of parcels, though some sections of the warehouse were spared. Initial investigations suggest an electrical short circuit as the cause, but forensic teams are still gathering evidence.\n\nThe blaze underscores vulnerabilities in Thailand's postal infrastructure, which has struggled with both accidents and delays in recent years.",
    "date": "2025-08-03",
    "reporter": "BBC News",
    "image": "69.jpg",
    "votes": {
      "real": 361,
      "fake": 81
    }
  },
  {
    "id": 70,
    "title": "Phuket Waste Crisis Escalates; Mayor Refuses to Quit",
    "details": "Phuket is struggling to manage more than 1,300 tonnes of garbage daily. On July 29, Mayor Suphot La-ongphet inspected the overwhelmed Phuket Central Waste Disposal Centre alongside engineers and council officials.\n\nDespite admitting that the landfill is operating beyond capacity, the mayor vowed not to resign. He emphasized that the crisis stems from Phuket's rapid growth in population and tourism. Garbage volumes spiked even during the recent low tourist season.\n\nAn emergency meeting of the Phuket Provincial Waste Board was called for July 31, led by the governor, to devise urgent short- and long-term solutions. The situation has been described by local officials as critical.",
    "date": "2025-07-29",
    "reporter": "Reuters",
    "image": "70.jpg",
    "votes": {
      "real": 392,
      "fake": 90
    }
  },
  {
    "id": 71,
    "title": "Shop Owner Seeks Lottery Luck from Temple Spirit",
    "details": "On July 30, a 44-year-old shop owner from Nakhon Pathom visited Wat Phai Lom to pray for good fortune at the shrine of the temple's Kuman Sombat statue.\n\nCarrying offerings of flowers, incense, and sweets, the shopkeeper performed a ritual in hopes of receiving lucky lottery numbers. The number 353 appeared in the ritual's outcome, which he interpreted as a sign for the upcoming draw.\n\nWat Phai Lom has become popular among Thais seeking lottery blessings, with stories of previous visitors winning large sums adding to the shrine's reputation.",
    "date": "2025-07-30",
    "reporter": "CNN News",
    "image": "71.jpg",
    "votes": {
      "real": 348,
      "fake": 95
    }
  },
  {
    "id": 72,
    "title": "New Zealand Tourists Earn Praise for Returning Lost Cash in Phuket",
    "details": "Two New Zealand tourists earned praise after returning around 1,500 Malaysian ringgit they found in Phuket. They handed the money to a local police station, and it was returned to its owner.\n\nThai netizens applauded their honesty, calling them role models for other travelers. Officials said the act showed that tourism can bring kindness, not just problems.",
    "date": "2025-08-01",
    "reporter": "BBC News",
    "image": "72.jpg",
    "votes": {
      "real": 367,
      "fake": 82
    }
  },
  {
    "id": 73,
    "title": "Flooding in Chiang Rai's Mae Sai District",
    "details": "Heavy rainfall in early August caused the Sai River in Chiang Rai's Mae Sai district to overflow, flooding several communities and forcing evacuations.\n\nEmergency teams provided boats for transportation, and military units helped evacuate vulnerable residents. Relief supplies, including food, drinking water, and blankets, were distributed to affected households.\n\nOfficials warned that with continued rain forecast, flooding risk could spread further downstream near Myanmar.",
    "date": "2025-08-01",
    "reporter": "Reuters",
    "image": "73.jpg",
    "votes": {
      "real": 351,
      "fake": 76
    }
  },
  {
    "id": 74,
    "title": "Bangkok to Everest Base Camp Trekking Guide Highlights Adventure for Thai Travelers",
    "details": "Travel guides for Thai adventurers are highlighting the trek from Bangkok to Everest Base Camp in Nepal. Most travelers fly from Bangkok to Kathmandu, then take a short flight to Lukla, the trek's starting point.\n\nThe journey typically takes 12-14 days and reaches elevations above 5,000 meters. Permits, physical preparation, and acclimatization are essential due to the risk of altitude sickness.\n\nDespite the challenges, the Everest Base Camp route is promoted as a bucket list adventure for Thai travelers.",
    "date": "2025-08-01",
    "reporter": "BBC News",
    "image": "74.jpg",
    "votes": {
      "real": 338,
      "fake": 74
    }
  },
  {
    "id": 75,
    "title": "Drunk Russian Crashes into Thai Woman's Car in Phuket",
    "details": "A Russian tourist was arrested in Phuket after crashing his car into a Thai woman's vehicle while heavily intoxicated. The collision occurred late at night and left the woman's car badly damaged.\n\nPolice conducted an alcohol test that confirmed the driver was over the legal limit. The incident has renewed calls for stricter enforcement of traffic laws for foreign tourists.",
    "date": "2025-08-02",
    "reporter": "CNN News",
    "image": "75.jpg",
    "votes": {
      "real": 326,
      "fake": 88
    }
  },
  {
    "id": 76,
    "title": "AC Unit Blamed for Fire Scare in Hotel Spa",
    "details": "Guests at a luxury hotel in central Bangkok were evacuated after smoke was spotted inside the hotel's spa on August 4. Firefighters responded quickly, and the cause was traced to a malfunctioning air-conditioning unit.\n\nNo injuries were reported. The hotel repaired the system and pledged to enhance safety inspections to prevent future incidents.",
    "date": "2025-08-04",
    "reporter": "BBC News",
    "image": "76.jpg",
    "votes": {
      "real": 312,
      "fake": 79
    }
  },
  {
    "id": 77,
    "title": "Thai National Caught Smuggling 3 Tons of Clams from Myanmar",
    "details": "Authorities in Ranong province intercepted a 37-year-old Thai man attempting to smuggle over three tons of clams from Myanmar into Thailand.\n\nOfficials confiscated the clams, valued at more than 300,000 baht, along with the boat used for transport. The suspect faces charges under Thailand's Fisheries Act.\n\nOfficials warned that seafood smuggling bypasses taxes, risks introducing disease, and undermines sustainable fishing.",
    "date": "2025-08-02",
    "reporter": "Reuters",
    "image": "77.jpg",
    "votes": {
      "real": 334,
      "fake": 85
    }
  },
  {
    "id": 78,
    "title": "Fire Erupts at Abandoned Ratsada House After 20 Years of Silence",
    "details": "On August 5, firefighters extinguished a blaze at an abandoned house in Phuket's Ratsada district that had been left untouched for more than two decades.\n\nNeighbors reported smoke late at night. Firefighters battled the flames for over an hour before bringing them under control. No injuries were reported, but the house sustained heavy damage.\n\nThe cause is believed to be an electrical fault from old wiring, though arson has not been ruled out.",
    "date": "2025-08-05",
    "reporter": "CNN News",
    "image": "78.jpg",
    "votes": {
      "real": 319,
      "fake": 77
    }
  },
  {
    "id": 79,
    "title": "Phuket Woman Runs from Grab Rider After Fake Cash Promise",
    "details": "A Phuket woman narrowly avoided fraud when a Grab rider attempted to pay her with counterfeit cash upon delivery.\n\nShe noticed irregularities in the banknotes, ran to safety, and reported the case to authorities. Police are investigating whether the rider is part of a larger network targeting delivery services.\n\nThe incident sparked debate about safety for vendors using delivery apps and calls for stricter verification measures.",
    "date": "2025-08-06",
    "reporter": "BBC News",
    "image": "79.jpg",
    "votes": {
      "real": 328,
      "fake": 81
    }
  },
  {
    "id": 80,
    "title": "Thailand Targets 2.8 Trillion Baht in Tourism Revenue by 2026",
    "details": "The Tourism Authority of Thailand set a target of generating 2.8 trillion baht in tourism revenue by 2026, focusing on high-spending visitors, digital platforms, and sustainable tourism.\n\nPlans include strengthening air connectivity and marketing Thailand as a year-round destination. The government expects tourism to play a central role in economic recovery, creating jobs and stimulating local economies.\n\nOfficials are confident that with global demand rebounding, Thailand can return to pre-pandemic tourism levels within two years.",
    "date": "2025-08-01",
    "reporter": "Reuters",
    "image": "80.jpg",
    "votes": {
      "real": 401,
      "fake": 79
    }
  },
  {
    "id": 81,
    "title": " Air Canada Passenger Crisis",
    "details": "Canada’s largest airline, Air Canada, is facing a severe travel crisis as more than 10,000 flight attendants prepare to strike over what they describe as poverty wages and unpaid labor during ground operations. The disruption, which comes at the height of the busy summer travel season, has already forced the carrier to begin canceling flights, with a full shutdown looming if no agreement is reached. The airline estimates that more than 130,000 passengers per day could be affected, raising fears of cascading delays across North America and beyond. Negotiations between Air Canada and the Canadian Union of Public Employees (CUPE) have been ongoing since March, but the two sides remain far apart on issues of wages, inflation adjustments, and compensation for pre-flight and post-flight duties. While Air Canada claims it has offered more than a 38% increase in total compensation, the union insists that the figure does not reflect the realities of rising living costs or address the fundamental inequities of unpaid work. The government has so far resisted direct intervention, with Labor Minister Patty Hajdu stating that agreements should be reached independently. However, public frustration is mounting as travelers find themselves stranded or forced to seek costly alternatives. The crisis highlights broader challenges in the aviation sector, where airlines are under pressure to balance profitability with fair labor practices amid post-pandemic demand surges and staffing shortages.",
    "date": "2025-08-01",
    "reporter": "BBC News",
    "image": "81.jpg",
    "votes": {
      "real": 520,
      "fake": 48
    }
  },
  {
    "id": 82,
    "title": " How Putin Brushed Off Trump’s Latest Push for Peace in Ukraine",
    "details": "Diplomatic tensions intensified this week as Russian President Vladimir Putin appeared to dismiss U.S. President Donald Trump’s renewed push for peace in Ukraine. After hosting Ukrainian President Volodymyr Zelensky and several European leaders in Washington, Trump phoned Putin late at night to propose direct talks with Zelensky in the hope of breaking the stalemate. The Kremlin, however, issued only a vague statement about possibly raising the level of representatives at future negotiations, avoiding any commitment to a high-level meeting. At the same time, Moscow doubled down on its hardline stance, warning that any NATO-style security guarantees for Ukraine would trigger unpredictable consequences and escalate the war. Trump initially promised robust Western protections for Kyiv but softened his language later in the day, reflecting the Kremlin’s pressure. The lack of progress underscored Washington’s limited leverage: Trump has already ruled out imposing new sanctions on Russia, removing one of his strongest bargaining tools. For Ukraine, the outcome was deeply unsettling. Without firm guarantees of Western support, Zelensky risks being left exposed in the face of continued Russian aggression. The episode highlights the ongoing diplomatic stalemate, where Moscow’s strategy of delay and obstruction continues to stall peace efforts while allowing Russia to consolidate gains on the battlefield.",
    "date": "2025-08-02",
    "reporter": "CNN News",
    "image": "82.jpg",
    "votes": {
      "real": 460,
      "fake": 52
    }
  },
  {
    "id": 83,
    "title": " Global Tech Downgraded",
    "details": "Analysts are sounding alarms over the global technology sector as forecasts for IT spending growth in 2025 are being revised downward due to mounting trade policy uncertainty. Initially expected to reach $6 trillion, projections now place growth within the $4.9 to $5.7 trillion range, with maximum growth capped at around 7%. The cautious outlook reflects growing concerns over tariffs and potential trade wars, particularly those involving the United States, India, and China. India’s massive IT outsourcing sector is seen as particularly vulnerable, with speculation that a 50% tariff on its services could cripple one of its most vital industries. Despite these challenges, some areas remain resilient. Demand for artificial intelligence (AI) and cloud services continues to grow rapidly, prompting businesses to prioritize spending on data centers, AI-optimized servers, and infrastructure that supports digital transformation. Gartner’s latest forecast predicts an 8% increase in global IT spending to $5.43 trillion, down from earlier estimates of 10%. Analysts note that while AI and cloud remain bright spots, uncertainty over tariffs is leading many companies to delay or cancel long-term projects. The sector’s struggles underscore how deeply trade tensions influence business confidence, with ripple effects across employment, investment, and innovation worldwide.",
    "date": "2025-08-03",
    "reporter": "BBC News",
    "image": "83.jpg",
    "votes": {
      "real": 440,
      "fake": 65
    }
  },
  {
    "id": 84,
    "title": " How Global Tensions Are Complicating Tariff-Fueled Inflation Risks",
    "details": "Economists warn that geopolitical tensions are adding new layers of risk to global inflation, particularly as tariffs and energy dependencies intertwine with foreign policy. The Trump administration’s plan to impose heavy tariffs on India, a major importer of Russian oil, has triggered concerns about energy prices and inflationary pressures across global markets. Officials are also weighing fresh sanctions on Russia’s oil sector as its war in Ukraine grinds on, a move that could drive energy prices higher despite recent stability. Analysts say the White House strategy represents a two-pronged approach: targeting India’s reliance on Russian crude while simultaneously raising tariffs on Indian goods. Critics argue that such measures could hurt U.S.-India relations and disrupt global supply chains, while doing little to curb Moscow’s war economy. Energy analysts note that while oil prices are currently stable and demand relatively weak, any major supply shock could quickly upend markets. This dynamic recalls the early days of the Ukraine invasion, when energy shortages spiked inflation worldwide. For now, markets remain cautiously optimistic, but economists stress that tariffs, sanctions, and trade frictions remain unpredictable forces that could reignite inflationary pressures at any moment.",
    "date": "2025-08-04",
    "reporter": "Reuters",
    "image": "84.jpg",
    "votes": {
      "real": 410,
      "fake": 72
    }
  },
  {
    "id": 85,
    "title": " US Trade Strategy Questioned",
    "details": "The Trump administration’s trade policies, centered on sweeping tariffs, are under growing scrutiny as economists and industry leaders question their effectiveness. Officials claim the tariffs are designed to protect domestic industries and reduce trade imbalances, but critics argue they have increased costs for consumers while triggering retaliatory measures from trading partners. China, in particular, has struck back with tariffs on U.S. goods, further complicating supply chains. Economists also question whether tariffs can meaningfully address the U.S. trade deficit, noting that foreign investment, not trade barriers, plays the largest role. In manufacturing, the hoped-for renaissance has not materialized, with companies reporting higher costs rather than increased output. Critics say the tariffs are being implemented inconsistently, creating uncertainty for businesses and investors. The administration’s approach has also raised questions about fairness, as the U.S. targets countries with higher tariffs on American goods but offers little clarity on how disputes will be resolved. The evolving strategy has created volatility, with new tariffs and countermeasures announced regularly. Business groups warn that prolonged uncertainty could discourage investment, while economists caution that the long-term costs may outweigh any short-term gains in protecting domestic industries.",
    "date": "2025-08-05",
    "reporter": "Financial Times",
    "image": "85.jpg",
    "votes": {
      "real": 395,
      "fake": 60
    }
  },
  {
    "id": 86,
    "title": " CSL Restructuring",
    "details": "Global healthcare giant CSL is undertaking its largest restructuring in decades in a bid to maintain competitiveness amid slowing growth and tariff-related pressures. The Australian company announced it would cut 3,000 jobs—around 15% of its workforce—while spinning off its underperforming vaccines division, CSL Seqirus. Investors reacted sharply, sending shares down 17%, the steepest decline since CSL’s listing in 1994, wiping out approximately $20 billion in market capitalization. The restructuring plan, spearheaded by CEO Paul McKenzie, aims to reduce costs by up to $550 million annually while raising $17 billion through the vaccines spinoff. CSL, best known for its plasma-derived therapies, faces increasing competition, rising costs, and uncertainty tied to trade tensions and tariffs under the Trump administration. As part of the restructuring, CSL will consolidate its research and development hubs, merge divisions, and streamline operations to focus on its core plasma therapies and iron deficiency treatments. Critics warn that cutting thousands of jobs could damage the company’s innovation pipeline, but executives argue that bold action is necessary to sustain growth. Analysts say the restructuring highlights the challenges facing global healthcare companies as they navigate competitive pressures and unpredictable economic policies.",
    "date": "2025-08-06",
    "reporter": "Bloomberg",
    "image": "86.jpg",
    "votes": {
      "real": 380,
      "fake": 55
    }
  },
  {
    "id": 87,
    "title": " Oil Supply Forecasts Raised",
    "details": "The International Energy Agency (IEA) has raised its forecast for global oil supply growth in 2025, citing a decision by OPEC+ to increase production. The agency now expects supply to rise by 2.5 million barrels per day (bpd), up from its earlier forecast of 2.1 million bpd. However, the outlook for demand is less optimistic. The IEA revised its demand forecast downward to 680,000 bpd, noting sluggish consumption across major economies and persistent weakness in consumer confidence. Oil prices briefly dipped after the report’s release, reflecting investor concerns that higher supply could outpace demand. Despite OPEC+’s output hike, the IEA predicts that non-OPEC producers will remain the primary drivers of supply growth, with the U.S. and Brazil leading the expansion. Global refining activity is also projected to approach a record 85.6 million bpd in August, underscoring robust investment in refining capacity despite uneven demand. Analysts note that the mismatch between supply and demand could keep oil markets volatile, with potential geopolitical risks—ranging from Middle East tensions to Russian sanctions—capable of shifting the balance quickly. The IEA’s report reinforces the complexity of the energy landscape, where abundant supply coexists with fragile demand.",
    "date": "2025-08-07",
    "reporter": "IEA",
    "image": "87.jpg",
    "votes": {
      "real": 405,
      "fake": 50
    }
  },
  {
    "id": 88,
    "title": " Dollar Gains on Ukraine Diplomacy",
    "details": "Financial markets opened the week on a cautiously optimistic note as signs of progress in Ukraine diplomacy lifted sentiment. European equity markets edged higher after President Volodymyr Zelensky suggested that security guarantees for Ukraine could be finalized within 10 days following discussions with U.S. President Donald Trump and European leaders. Traders viewed the possibility of a Putin-Zelensky meeting, as well as a potential trilateral summit, as a positive step toward ending the conflict. Asian markets, however, were more subdued, with most indices trading flat as investors weighed geopolitical risks against the upcoming Federal Reserve symposium in Jackson Hole. Oil prices softened slightly, reflecting cautious optimism that easing tensions could stabilize energy markets. Analysts note that while diplomacy is a welcome development, investors remain wary of overreacting given the long history of stalled negotiations. Still, the dollar gained ground against major currencies, supported by hopes that geopolitical progress could reduce global uncertainty. The balance between diplomatic breakthroughs and lingering risks is likely to continue driving volatility in the weeks ahead.",
    "date": "2025-08-08",
    "reporter": "Reuters",
    "image": "88.jpg",
    "votes": {
      "real": 420,
      "fake": 58
    }
  },
  {
    "id": 89,
    "title": " Trump’s Visa Crackdown",
    "details": "The U.S. State Department has revoked more than 6,000 international student visas as part of President Trump’s escalating crackdown on immigration. Officials cited violations ranging from criminal offenses such as assault and driving under the influence to alleged support for terrorism. While the administration did not specify details of the terrorism-related claims, reports indicate that students who expressed support for Palestinian causes were among those targeted, raising concerns of political bias. About 4,000 visas were revoked for criminal violations, while an additional 200 to 300 were linked to terrorism-related classifications under the Immigration and Nationality Act. The policy has drawn sharp criticism from universities and advocacy groups, who argue that the broad revocations undermine due process and discourage international students from pursuing education in the U.S. Earlier this year, the government also implemented new social media vetting rules, requiring applicants to disclose their accounts for enhanced screening. Critics argue the measures will deter talented students from enrolling in American institutions, potentially weakening the U.S.’s standing as a global education hub. Secretary of State Marco Rubio defended the policy, stating that the U.S. must prioritize security, but opponents say the approach conflates national security with suppression of dissent and academic freedom.",
    "date": "2025-08-09",
    "reporter": "CNN",
    "image": "89.jpg",
    "votes": {
      "real": 390,
      "fake": 62
    }
  },
  {
    "id": 90,
    "title": " Toronto Crypto Company CEO Kidnapped, Held for $1M Ransom",
    "details": "Toronto police are investigating a high-profile kidnapping involving Dean Skurka, the CEO of WonderFi, a leading cryptocurrency and financial technology firm. The incident occurred during rush hour in downtown Toronto, when suspects reportedly forced Skurka into a vehicle near University Avenue and Richmond Street West. The kidnappers demanded a ransom of $1 million, which was later paid electronically, leading to Skurka’s release in Etobicoke’s Centennial Park. Authorities have not disclosed whether the ransom has been recovered or if arrests have been made. Skurka confirmed via email that he was involved in an “incident” but assured clients that funds and data remained secure. WonderFi also issued a statement emphasizing the safety of its employees and the integrity of its systems. The case has drawn significant attention given the high-profile nature of the victim and the cryptocurrency sector’s association with financial crime. Analysts note that the incident could intensify calls for stronger regulation and security measures within the fintech industry. For now, Toronto police continue their investigation, treating the kidnapping as a targeted attack rather than a random act of violence.",
    "date": "2025-08-10",
    "reporter": "CBC News",
    "image": "90.jpg",
    "votes": {
      "real": 375,
      "fake": 45
    }
  },
  {
    "id": 91,
    "title": " Policy and Refugee Ban Updates",
    "details": "Legal and policy battles continue to swirl around the Trump administration’s refugee ban, with recent court rulings and government decisions leaving thousands of refugees in limbo. A federal judge in Seattle recently ordered the U.S. to admit refugees who had received prior approvals before the ban took effect, though the scope of the order remains contested. The Welcome Corps program, which facilitated private sponsorship of refugees, has been abruptly terminated, closing the application portal and leaving sponsors uncertain about the future. At the same time, the government has introduced new fees for asylum seekers applying for work permits, requiring $550 for initial applications and higher renewal costs. Critics argue that the changes place heavy financial burdens on already vulnerable populations while undermining America’s humanitarian commitments. Human rights groups continue to raise alarms, highlighting the human impact of the policy, including separated families and indefinite delays in resettlement. Meanwhile, immigration lawyers warn that the policy changes are creating a patchwork of inconsistent rulings that complicate the lives of refugees and their advocates. As the legal battles continue, organizations such as the International Refugee Assistance Project are calling for urgent reforms to restore predictability and fairness to the resettlement process.",
    "date": "2025-08-11",
    "reporter": "New York Times",
    "image": "91.jpg",
    "votes": {
      "real": 400,
      "fake": 50
    }
  },
  {
    "id": 92,
    "title": " Global Fragility and Climates",
    "details": "Experts warn that climate change is emerging as a ‘threat multiplier’ in fragile states, intensifying humanitarian crises and fueling conflict. Fragile countries already grappling with weak governance, poverty, and instability are being hit hardest by climate shocks such as droughts, floods, and extreme weather events. These disasters not only displace populations but also undermine livelihoods, particularly in agriculture-dependent regions, leading to food insecurity and economic hardship. Resource competition is another flashpoint, with water and arable land becoming scarcer, sparking tensions both within and across borders. Analysts point to transboundary rivers as potential sources of future conflict, especially when access to water is uneven. Livelihood insecurity often forces mass displacement, straining host communities and exacerbating social divisions. Economists also warn of broader instability, as climate impacts can cause sudden economic shocks by damaging infrastructure and reducing productivity. Policymakers emphasize that adaptation strategies in fragile states must be tailored to address both environmental and political vulnerabilities. Increased international cooperation and funding are seen as essential to build resilience and prevent climate-related conflicts. Without urgent action, climate change threatens to deepen global fragility, creating cycles of instability that will be difficult to reverse.",
    "date": "2025-08-12",
    "reporter": "UN Environment",
    "image": "92.jpg",
    "votes": {
      "real": 425,
      "fake": 55
    }
  },
  {
    "id": 93,
    "title": " Air Canada to Gradually Resume Flights After Settlement with Union",
    "details": "After days of chaos that disrupted travel plans for thousands of passengers, Air Canada has announced a settlement with its flight attendants’ union, paving the way for flights to gradually resume. The mediated agreement, reached under the oversight of a neutral arbitrator, resolves a dispute that had centered on wages and unpaid labor. Approximately 10,000 flight attendants had walked off the job despite a government back-to-work order, demanding pay increases that match inflation and full compensation for ground duties performed before takeoff and after landing. The settlement terms have not been publicly disclosed, but both sides confirmed that operations would restart immediately. The airline said it would begin rescheduling grounded Air Canada and Air Canada Rouge flights in stages, advising customers to monitor communications for updates. The agreement has been welcomed by business groups and tourism leaders who had warned that a prolonged shutdown would cause severe economic damage during peak travel season. Union leaders, meanwhile, expressed cautious optimism, saying the settlement addresses core concerns but acknowledging that enforcement will be key. For travelers, the resolution offers relief after days of uncertainty, though experts warn that the episode may have lasting effects on customer confidence in Air Canada.",
    "date": "2025-08-13",
    "reporter": "CBC News",
    "image": "93.jpg",
    "votes": {
      "real": 410,
      "fake": 48
    }
  },
  {
    "id": 94,
    "title": "Ukraine and Sweden Signed a Security Agreement",
    "details": "In a significant development, Ukrainian President Volodymyr Zelensky and Swedish Prime Minister Ulf Kristersson signed a landmark security agreement in Stockholm, deepening military and strategic ties between the two nations. The deal, valued at 75 billion Swedish kronor (approximately €6.5 billion), commits Sweden to providing Ukraine with annual military assistance of around €2.2 billion through 2026. The agreement extends beyond immediate aid, setting a ten-year framework for cooperation. Swedish support will include advanced systems such as Archer artillery units, CV90 combat vehicles, and the transfer of specialized ASC 890 aircraft. The agreement also lays the groundwork for training Ukrainian pilots on JAS 39 Gripen fighter jets, raising the possibility of future deliveries. Beyond hardware, Sweden pledged to support Ukraine’s defense industry, focusing on joint production, repair, and maintenance of Swedish military equipment inside Ukraine. Other provisions address humanitarian support, reconstruction, sanctions against Russia, and backing for Ukraine’s path toward EU and NATO membership. Analysts say the agreement underscores Sweden’s growing role as a European security actor, especially amid heightened Russian aggression. For Ukraine, the deal represents both immediate military relief and long-term strategic reassurance, strengthening its position in resisting Russian advances.",
    "date": "2025-08-14",
    "reporter": "Reuters",
    "image": "94.jpg",
    "votes": {
      "real": 430,
      "fake": 50
    }
  },
  {
    "id": 95,
    "title": " Businesses Are Cautiously Spending on Corporate Travel",
    "details": "Despite economic uncertainty and shifting trade dynamics, businesses are continuing to invest in corporate travel, though spending patterns reflect a more cautious approach. According to reports from the Global Business Travel Association (GBTA) and Navan, business travel spending rose 15% in the second quarter of 2025 compared to the previous year. However, forecasts for full-year growth have been revised downward to 6.6%, well below the earlier projection of 10.4%. Executives attribute the more measured pace to policy uncertainty and tariff risks under President Trump’s administration. Companies appear reluctant to cut travel altogether but are prioritizing trips that deliver clear value, particularly one-on-one meetings and client-facing activities. Spending on team events and group outings has declined, while one-on-one meal meetings are up nearly 10%. Airfare prices have fallen by 3.5% year-over-year, providing some relief for corporate budgets, and there are signs of increased bookings in premium cabins as confidence improves. Analysts say the changes reflect a broader evolution in corporate culture, where travel is increasingly measured against return on investment. Industry leaders stress that business travel remains a critical tool for relationship-building, but cost discipline will remain a guiding principle until global trade policy stabilizes.",
    "date": "2025-08-15",
    "reporter": "Forbes",
    "image": "95.jpg",
    "votes": {
      "real": 395,
      "fake": 48
    }
  },
  {
    "id": 96,
    "title": " Egypt Launches National Film Revival Plan",
    "details": "Egypt’s Culture Minister Ahmed Fouad Henno has unveiled a wide-ranging national strategy aimed at reviving the country’s film industry, once regarded as the Hollywood of the Middle East. The plan seeks to modernize state-owned studios, restore Egypt’s vast cinematic heritage, and create a sustainable infrastructure to support both local and international productions. Among the facilities slated for major upgrades are Cinema City, Studio Nahhas, and Studio Ahram, which will be equipped with advanced digital archiving systems, high-definition sound stages, and cutting-edge restoration technology. A key component of the plan is the preservation and promotion of Egypt’s cinematic history. Classic Egyptian films, many of which defined Arab cinema during its golden age, are being remastered in 4K resolution for digital release and distribution at international film festivals. The government also announced the creation of a dedicated film festival focusing exclusively on restored works, providing a platform for global audiences to rediscover Egypt’s rich cultural legacy. Officials emphasized that this initiative will not only safeguard the past but also inspire future filmmakers. At the same time, the Ministry of Culture is establishing a new professional entity tasked with managing national productions, promoting Egypt’s film industry abroad, and attracting foreign investment.",
    "date": "2025-08-16",
    "reporter": "Al Jazeera",
    "image": "96.jpg",
    "votes": {
      "real": 380,
      "fake": 52
    }
  },
  {
    "aid": 97,
    "title": "Dollar Slips as Markets Digest Ukraine Summit",
    "details": "The U.S. dollar weakened slightly against major currencies after a closely watched summit involving leaders from the United States, Europe, and Ukraine. Investors were cautious as they awaited further guidance from the Federal Reserve’s Jackson Hole symposium, particularly regarding interest rate policy. European equities recorded modest gains, supported by a sense of progress in diplomatic discussions, while oil prices fell due to expectations that tensions in Eastern Europe may stabilize global energy supplies. Analysts noted that the Russia-Ukraine conflict, which has roiled markets for more than two years, is currently exerting less pressure on the euro as energy markets remain relatively balanced.\n\nMarket analysts attributed the muted reaction to a combination of low summer trading volumes and uncertainty over monetary policy. With the Federal Reserve expected to signal whether rate cuts are forthcoming, investors are reluctant to take large positions. Meanwhile, European Central Bank officials have reiterated their commitment to controlling inflation, which remains above target in several member states. This cautious monetary environment has limited volatility in foreign exchange markets despite significant geopolitical headlines.\n\nOverall, the dollar’s slight decline reflects a broader sense of wait-and-see sentiment among traders. While geopolitical developments continue to influence investor confidence, attention is shifting to upcoming central bank meetings and economic data releases that will more directly determine the direction of currency and commodity markets in the months ahead.",
    "date": "2025-08-17",
    "reporter": "Reuters",
    "image": "97.jpg",
    "votes": {
      "real": 320,
      "fake": 45
    }
  },
  {
    "aid": 98,
    "title": "Trump Proposes Putin-Zelensky Summit",
    "details": "President Donald Trump has announced plans for a potential face-to-face summit between Russian President Vladimir Putin and Ukrainian President Volodymyr Zelensky, a move he described as a breakthrough opportunity to end the war. The proposal followed high-level discussions at the White House with European leaders, where Trump emphasized the importance of direct dialogue between Moscow and Kyiv. Vice President JD Vance and Secretary of State Marco Rubio have been tasked with coordinating the summit’s preparations, signaling Washington’s intent to take a leading role in facilitating the negotiations.\n\nZelensky welcomed the proposal, stating that Ukraine is ready for talks that include clear security guarantees and territorial integrity as central conditions. European leaders also cautiously endorsed the initiative, stressing the importance of diplomacy while warning that any deal must not compromise Ukraine’s sovereignty. Their reaction underscored the delicate balance between pursuing peace and ensuring that Ukraine does not face pressure to accept unfavorable terms.\n\nMoscow, however, has so far offered no firm confirmation of its participation, issuing only vague statements about potential future dialogue. Analysts suggest that Russia’s reluctance stems from its desire to consolidate military gains before entering into negotiations. Despite the uncertainty, Trump’s proposal has generated significant global attention, with investors and policymakers watching closely to see whether the plan can overcome longstanding obstacles that have derailed previous peace efforts.",
    "date": "2025-08-17",
    "reporter": "CNN",
    "image": "98.jpg",
    "votes": {
      "real": 290,
      "fake": 60
    }
  },
  {
    "aid": 99,
    "title": "Stock Markets Cautious Amid Ukraine Talks",
    "details": "Global stock markets delivered a mixed performance as peace talks between Ukraine and Russia appeared to advance. European indices rose modestly, buoyed by optimism that negotiations could ease geopolitical tensions and reduce risks to energy supply chains. In contrast, Wall Street posted a more cautious response, with investors divided over the impact of diplomacy on corporate earnings and global growth. Defense sector stocks in particular declined on speculation that reduced demand for arms could follow if a peace agreement were reached, highlighting how markets are closely tied to geopolitical developments.\n\nTraders also focused heavily on the upcoming speech by U.S. Federal Reserve Chair Jerome Powell at the Jackson Hole symposium, where expectations of interest rate adjustments are high. Many analysts believe Powell’s remarks could set the tone for global monetary policy in the months ahead, influencing not only equities but also currencies and commodities. Oil prices edged lower on the possibility that a Ukraine deal might lead to eased sanctions on Russian energy, while energy-importing nations welcomed the potential for more stable prices.\n\nIn corporate news, Intel’s stock surged after Japanese tech conglomerate SoftBank announced a $2 billion investment, reflecting growing interest in revitalizing the semiconductor industry. The contrasting trends — optimism in technology, caution in defense, and uncertainty in energy — illustrate how global markets are navigating a complex environment shaped by both diplomatic efforts and economic policy shifts.",
    "date": "2025-08-17",
    "reporter": "Bloomberg",
    "image": "99.jpg",
    "votes": {
      "real": 345,
      "fake": 50
    }
  },
  {
    "aid": 100,
    "title": "Financial Sector Buzz: SoftBank Invests in Intel, Apple Expands in India",
    "details": "The global financial sector was abuzz this week after two major announcements signaled significant shifts in technology and manufacturing. Japanese investment giant SoftBank confirmed a $2 billion investment in Intel, acquiring a 2% stake in the struggling chipmaker. The move is intended to provide Intel with fresh capital as it attempts to execute a turnaround strategy focused on advanced semiconductor manufacturing and AI-driven technology. Industry analysts said SoftBank’s involvement reflects confidence in Intel’s long-term prospects, despite the company’s recent struggles to compete with rivals like TSMC and AMD.\n\nMeanwhile, Apple revealed plans to expand iPhone 17 production in India, marking a milestone in its strategy to diversify supply chains away from China. For the first time, Apple announced that all iPhone 17 models destined for the U.S. market will be manufactured in India. The move not only reduces Apple’s reliance on Chinese factories but also strengthens India’s growing role as a global manufacturing hub. Indian officials celebrated the announcement, highlighting it as evidence of the country’s ability to attract high-value investment and create thousands of skilled jobs.\n\nAnalysts say the developments underscore two broader trends: a shift in global technology investment toward strategic partnerships and a realignment of supply chains amid rising tariffs and geopolitical tensions. Together, SoftBank’s bold bet on Intel and Apple’s India expansion suggest that companies are adapting quickly to a world where resilience and diversification are as important as efficiency and cost savings.",
    "date": "2025-08-17",
    "reporter": "Financial Times",
    "image": "100.jpg",
    "votes": {
      "real": 365,
      "fake": 40
    }
  },
  {
    "id": 97,
    "headline": "Matty ",
    "details": "MAtty",
    "reporter": "Anonymous",
    "date": "2025/8/23 16:25:30",
    "image": "https://via.placeholder.com/150",
    "votes": {
      "real": 0,
      "fake": 0
    },
    "comments": []
  }
]